Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/source/ram/usb_otg/dwc_otg_regs.h
/* ==========================================================================
 * $File: //dwh/usb_iip/dev/software/otg/linux/drivers/dwc_otg_regs.h $
 * $Revision: #99 $
 * $Date: 2012/12/10 $
 * $Change: 2123206 $
 *
 * Synopsys HS OTG Linux Software Driver and documentation (hereinafter,
 * "Software") is an Unsupported proprietary work of Synopsys, Inc. unless
 * otherwise expressly agreed to in writing between Synopsys and you.
 *
 * The Software IS NOT an item of Licensed Software or Licensed Product under
 * any End User Software License Agreement or Agreement for Licensed Product
 * with Synopsys or any supplement thereto. You are permitted to use and
 * redistribute this Software in source and binary forms, with or without
 * modification, provided that redistributions of source code must retain this
 * notice. You may not view, use, disclose, copy or distribute this file or
 * any information contained herein except pursuant to this license grant from
 * Synopsys. If you do not agree with this notice, including the disclaimer
 * below, then you are not authorized to use the Software.
 *
 * THIS SOFTWARE IS BEING DISTRIBUTED BY SYNOPSYS SOLELY ON AN "AS IS" BASIS
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE HEREBY DISCLAIMED. IN NO EVENT SHALL SYNOPSYS BE LIABLE FOR ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
 * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
 * DAMAGE.
 * ========================================================================== */

#ifndef __DWC_OTG_REGS_H__
#define __DWC_OTG_REGS_H__

#include "dwc_otg_core_if.h"

#if 0 //wei add
#define HAL_OTG_READ32(addr)            HAL_READ32(USB_BASE, (uint32_t)addr)
#define HAL_OTG_WRITE32(addr, value)    HAL_WRITE32(USB_BASE, (uint32_t)addr, value)
#else


#endif

#if 1
extern unsigned int HAL_OTG_READ32(unsigned int addr);
extern void HAL_OTG_WRITE32(unsigned int addr, unsigned int value);

#define DWC_READ_REG32(_reg_)   HAL_OTG_READ32((uint32_t)_reg_)
#define DWC_WRITE_REG32(_reg_, _val_)   HAL_OTG_WRITE32((uint32_t)_reg_,(uint32_t)_val_)
//#define DWC_MODIFY_REG32(_reg_,_cmsk_,_smsk_)   HAL_OTG_MODIFY32((uint32_t)_reg_,_cmsk_,_smsk_)
#define DWC_MODIFY_REG32(_reg_,_cmsk_,_smsk_)    DWC_WRITE_REG32((uint32_t)_reg_,   ((DWC_READ_REG32( (uint32_t)_reg_) & (~(uint32_t)_cmsk_)) |(uint32_t) _smsk_))


#endif

#define REG_OTG_PWCSEQ_IP_OFF               0x30004     //This is in OTG IP
#define REG_OTG_PS_INTR_STS                 0x30008     //This is in OTG IP
#define REG_OTG_PS_INTR_MSK                 0x3000C     //This is in OTG IP
#define REG_OTG_PS_SETUP_PKT_0              0x30010     //This is in OTG IP
#define REG_OTG_PS_SETUP_PKT_1              0x30014     //This is in OTG IP
#define REG_OTG_ADDON_VEND_STSOUT      0x3001c
#define REG_OTG_ADDON_SLBBIST_CTRL      0x30020
#define REG_OTG_ADDON_DBG_SEL             0x3002C
#define REG_OTG_ADDON_DBG_STS             0x30030


//REG_OTG_PWCSEQ_OTG
#define BIT_SHIFT_USBOTG_PS_EN   0
#define BIT_MASK_USBOTG_PS_EN    0x1
#define BIT_USBOTG_PS_EN(x)(((x) & BIT_MASK_USBOTG_PS_EN) << BIT_SHIFT_USBOTG_PS_EN)
#define BIT_INVC_USBOTG_PS_EN (~(BIT_MASK_USBOTG_PS_EN << BIT_SHIFT_USBOTG_PS_EN))

#define BIT_SHIFT_USBOTG_DIS_SUSB   1
#define BIT_MASK_USBOTG_DIS_SUSB    0x1
#define BIT_USBOTG_DIS_SUSB(x)(((x) & BIT_MASK_USBOTG_DIS_SUSB) << BIT_SHIFT_USBOTG_DIS_SUSB)
#define BIT_INVC_USBOTG_DIS_SUSB (~(BIT_MASK_USBOTG_DIS_SUSB << BIT_SHIFT_USBOTG_DIS_SUSB))

#define BIT_SHIFT_USBOTG_SUSBM   4
#define BIT_MASK_USBOTG_SUSBM    0x1
#define BIT_USBOTG_SUSBM(x)(((x) & BIT_MASK_USBOTG_SUSBM) << BIT_SHIFT_USBOTG_SUSBM)
#define BIT_INVC_USBOTG_SUSBM (~(BIT_MASK_USBOTG_SUSBM << BIT_SHIFT_USBOTG_SUSBM))

#define BIT_SHIFT_UPLL_CKRDY   5
#define BIT_MASK_UPLL_CKRDY    0x1
#define BIT_UPLL_CKRDY(x)(((x) & BIT_MASK_UPLL_CKRDY) << BIT_SHIFT_UPLL_CKRDY)
#define BIT_INVC_UPLL_CKRDY (~(BIT_MASK_UPLL_CKRDY << BIT_SHIFT_UPLL_CKRDY))

#define BIT_SHIFT_USB_LS        6
#define BIT_MASK_USB_LS    0x3
#define BIT_USB_LS(x)(((x) & BIT_MASK_USB_LS) << BIT_SHIFT_USB_LS)
#define BIT_INVC_USB_LS (~(BIT_MASK_USB_LS << BIT_SHIFT_USB_LS))

#define BIT_SHIFT_USBOTG_EN   8
#define BIT_MASK_USBOTG_EN    0x1
#define BIT_USBOTG_EN(x)(((x) & BIT_MASK_USBOTG_EN) << BIT_SHIFT_USBOTG_EN)
#define BIT_INVC_USBOTG_EN (~(BIT_MASK_USBOTG_EN << BIT_SHIFT_USBOTG_EN))

#define BIT_SHIFT_USBPHY_EN   9
#define BIT_MASK_USBPHY_EN    0x1
#define BIT_USBPHY_EN(x)(((x) & BIT_MASK_USBPHY_EN) << BIT_SHIFT_USBPHY_EN)
#define BIT_INVC_USBPHY_EN (~(BIT_MASK_USBPHY_EN << BIT_SHIFT_USBPHY_EN))

#define BIT_SHIFT_USB_GT_LS_EN   10
#define BIT_MASK_USB_GT_LS_EN    0x1
#define BIT_USB_GT_LS_EN(x)(((x) & BIT_MASK_USB_GT_LS_EN) << BIT_SHIFT_USB_GT_LS_EN)
#define BIT_INVC_USB_GT_LS_EN (~(BIT_MASK_USB_GT_LS_EN << BIT_SHIFT_USB_GT_LS_EN))

/**
  \brief  Type to access RTL8195B OTG(USB) function control register.
 */
#if 0 //pro1 
typedef union {
	uint32_t w;                         /*!< Type      used for word access */
	struct {
		uint32_t otg_en: 1;             /*!< bit:   0       enable OTG IP */
		uint32_t wd_rst_msk: 1;         /*!< bit:   1       mask watch dog reset */
		uint32_t rsvd0: 2;              /*!< bit:   2 to 3  reserved */
		uint32_t otg_clk_en: 1;         /*!< bit:   4       enable OTG clock */
		uint32_t rsvd1: 11;             /*!< bit:   5 to 15 reserved */
		uint32_t digi_pc_en: 1;         /*!< bit:   16      USB digital power cut enable */
		uint32_t rsvd2: 1;              /*!< bit:   17      reserved */
		uint32_t ana_hv_en: 1;          /*!< bit:   18      USB analog hv power cut enable */
		uint32_t bg_en: 1;              /*!< bit:   19      USB BG enable */
		uint32_t pdn: 1;                /*!< bit:   20      power down USB (default: 1) */
		uint32_t ibx_usb_en: 1;         /*!< bit:   21      enable IBX to USB */
		uint32_t ibx_mipi_en: 1;        /*!< bit:   22      enable IBX to MIPI */
		uint32_t rsvd3: 1;              /*!< bit:   23      reserved */
		uint32_t diso_en: 1;            /*!< bit:   24      enable USB digital iso (default: 1) */
		uint32_t aiso_en: 1;            /*!< bit:   24      enable USB analog iso (default: 1) */
	} b;                                /*!< Structure used for bit  access */
} hp_otg_func_ctrl_t, *php_otg_func_ctrl_t;
