Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/source/ram/usb_otg/dwc_otg_regs.h
#else  //pro2
typedef union {
	uint32_t w;                         /*!< Type      used for word access */
	struct {
		uint32_t otg_en: 1;             /*!< bit:   0       enable OTG IP */
		uint32_t wd_rst_msk: 1;         /*!< bit:   1       mask watch dog reset */
		uint32_t rsvd0: 1;              /*!< bit:   2   reserved */
		uint32_t LPM_PLL_ALIVE: 1; /* [3] */
		uint32_t otg_clk_en: 1;         /*!< bit:   4       enable OTG clock */
		uint32_t OTG_UTMI_CLK_EN: 1; /* [5] */
		uint32_t rsvd1: 10;             /*!< bit:   6 to 15 reserved */
		uint32_t digi_pc_en: 1;         /*!< bit:   16      USB digital power cut enable */
		uint32_t rsvd2: 1;              /*!< bit:   17      reserved */
		uint32_t ana_hv_en: 1;          /*!< bit:   18      USB analog hv power cut enable */
		uint32_t bg_en: 1;              /*!< bit:   19      USB BG enable */
		uint32_t pdn: 1;                /*!< bit:   20      power down USB (default: 1) */
		uint32_t ibx_usb_en: 1;         /*!< bit:   21      enable IBX to USB */
		uint32_t ibx_mipi_en: 1;        /*!< bit:   22      enable IBX to MIPI */
		uint32_t rsvd3: 1;              /*!< bit:   23      reserved */
		uint32_t diso_en: 1;            /*!< bit:   24      enable USB digital iso (default: 1) */
		uint32_t aiso_en: 1;            /*!< bit:   25      enable USB analog iso (default: 1) */
		uint32_t USBPHY_CKREF_SEL: 4; /*[29:26] */
		uint32_t USBPHY_XTAL_SEL: 1;  /*[30]*/
	} b;                                /*!< Structure used for bit  access */
} hp_otg_func_ctrl_t, *php_otg_func_ctrl_t;
#endif

#define HP_OTG_FUNC_CLK_CTRL_REG        ((hp_otg_func_ctrl_t *) (0x50000000 + 0x0800UL + 0x0120UL))

/**
  \brief  Type to access RTL8195B OTG(USB) power control register.
 */
typedef union {
	uint32_t w;                         /*!< Type      used for word access */
	struct {
		uint32_t pwr_sav_en: 1;         /*!< bit:   0       power saving enable */
		uint32_t susp_dis: 1;           /*!< bit:   1       suspend signal disable */
		uint32_t susp_to_one: 1;        /*!< bit:   2       suspend signal to 1 */
		uint32_t rsvd: 1;               /*!< bit:   3       reserved */
		uint32_t suspendm: 1;           /*!< bit:   4       suspendm signal (RO) */
		uint32_t phy_clk_rdy: 1;        /*!< bit:   5       PHY clock ready (RO) */
		uint32_t ls: 2;                 /*!< bit:   6 to 7  line state (RO) */
		uint32_t otg_co_en: 1;          /*!< bit:   8       enable otg core */
		uint32_t phy_en: 1;             /*!< bit:   9       enable PHY */
		uint32_t gate_ls_en: 1;         /*!< bit:   10      enable gate USB line state function */
	} b;
} hp_otg_pwr_ctrl_t, *php_otg_pwr_ctrl_t;

#define HP_OTG_PWR_CTRL_REG        ((hp_otg_pwr_ctrl_t *) (USB_BASE + 0x30004UL))


/**
 * @file
 *
 * This file contains the data structures for accessing the DWC_otg core registers.
 *
 * The application interfaces with the HS OTG core by reading from and
 * writing to the Control and Status Register (CSR) space through the
 * AHB Slave interface. These registers are 32 bits wide, and the
 * addresses are 32-bit-block aligned.
 * CSRs are classified as follows:
 * - Core Global Registers
 * - Device Mode Registers
 * - Device Global Registers
 * - Device Endpoint Specific Registers
 * - Host Mode Registers
 * - Host Global Registers
 * - Host Port CSRs
 * - Host Channel Specific Registers
 *
 * Only the Core Global registers can be accessed in both Device and
 * Host modes. When the HS OTG core is operating in one mode, either
 * Device or Host, the application must not access registers from the
 * other mode. When the core switches from one mode to another, the
 * registers in the new mode of operation must be reprogrammed as they
 * would be after a power-on reset.
 */

/****************************************************************************/
/** DWC_otg Core registers .
 * The dwc_otg_core_global_regs structure defines the size
 * and relative field offsets for the Core Global registers.
 */
typedef struct dwc_otg_core_global_regs {
	/** OTG Control and Status Register.  <i>Offset: 000h</i> */
	volatile uint32_t gotgctl;
	/** OTG Interrupt Register.  <i>Offset: 004h</i> */
	volatile uint32_t gotgint;
	/**Core AHB Configuration Register.  <i>Offset: 008h</i> */
	volatile uint32_t gahbcfg;

#define DWC_GLBINTRMASK     0x0001
#define DWC_DMAENABLE       0x0020
#define DWC_NPTXEMPTYLVL_EMPTY  0x0080
#define DWC_NPTXEMPTYLVL_HALFEMPTY  0x0000
#define DWC_PTXEMPTYLVL_EMPTY   0x0100
#define DWC_PTXEMPTYLVL_HALFEMPTY   0x0000

	/**Core USB Configuration Register.  <i>Offset: 00Ch</i> */
	volatile uint32_t gusbcfg;
	/**Core Reset Register.  <i>Offset: 010h</i> */
	volatile uint32_t grstctl;
	/**Core Interrupt Register.  <i>Offset: 014h</i> */
	volatile uint32_t gintsts;
	/**Core Interrupt Mask Register.  <i>Offset: 018h</i> */
	volatile uint32_t gintmsk;
	/**Receive Status Queue Read Register (Read Only).  <i>Offset: 01Ch</i> */
	volatile uint32_t grxstsr;
	/**Receive Status Queue Read & POP Register (Read Only).  <i>Offset: 020h</i>*/
	volatile uint32_t grxstsp;
	/**Receive FIFO Size Register.  <i>Offset: 024h</i> */
	volatile uint32_t grxfsiz;
	/**Non Periodic Transmit FIFO Size Register.  <i>Offset: 028h</i> */
	volatile uint32_t gnptxfsiz;
	/**Non Periodic Transmit FIFO/Queue Status Register (Read
	 * Only). <i>Offset: 02Ch</i> */
	volatile uint32_t gnptxsts;
	/**I2C Access Register.  <i>Offset: 030h</i> */
	volatile uint32_t gi2cctl;
	/**PHY Vendor Control Register.  <i>Offset: 034h</i> */
	volatile uint32_t gpvndctl;
	/**General Purpose Input/Output Register.  <i>Offset: 038h</i> */
	volatile uint32_t ggpio;
	/**User ID Register.  <i>Offset: 03Ch</i> */
	volatile uint32_t guid;
	/**Synopsys ID Register (Read Only).  <i>Offset: 040h</i> */
	volatile uint32_t gsnpsid;
	/**User HW Config1 Register (Read Only).  <i>Offset: 044h</i> */
	volatile uint32_t ghwcfg1;
	/**User HW Config2 Register (Read Only).  <i>Offset: 048h</i> */
	volatile uint32_t ghwcfg2;
#define DWC_SLAVE_ONLY_ARCH 0
#define DWC_EXT_DMA_ARCH 1
#define DWC_INT_DMA_ARCH 2

#define DWC_MODE_HNP_SRP_CAPABLE    0
#define DWC_MODE_SRP_ONLY_CAPABLE   1
#define DWC_MODE_NO_HNP_SRP_CAPABLE     2
#define DWC_MODE_SRP_CAPABLE_DEVICE     3
#define DWC_MODE_NO_SRP_CAPABLE_DEVICE  4
#define DWC_MODE_SRP_CAPABLE_HOST   5
#define DWC_MODE_NO_SRP_CAPABLE_HOST    6

	/**User HW Config3 Register (Read Only).  <i>Offset: 04Ch</i> */
	volatile uint32_t ghwcfg3;
	/**User HW Config4 Register (Read Only).  <i>Offset: 050h</i>*/
	volatile uint32_t ghwcfg4;
	/** Core LPM Configuration register <i>Offset: 054h</i>*/
	volatile uint32_t glpmcfg;
	/** Global PowerDn Register <i>Offset: 058h</i> */
	volatile uint32_t gpwrdn;
	/** Global DFIFO SW Config Register  <i>Offset: 05Ch</i> */
	volatile uint32_t gdfifocfg;
	/** ADP Control Register  <i>Offset: 060h</i> */
	volatile uint32_t adpctl;
	/** Reserved  <i>Offset: 064h-0FFh</i> */
	volatile uint32_t reserved39[39];
	/** Host Periodic Transmit FIFO Size Register. <i>Offset: 100h</i> */
	volatile uint32_t hptxfsiz;
	/** Device Periodic Transmit FIFO#n Register if dedicated fifos are disabled,
	    otherwise Device Transmit FIFO#n Register.
	 * <i>Offset: 104h + (FIFO_Number-1)*04h, 1 <= FIFO Number <= 15 (1<=n<=15).</i> */
	volatile uint32_t dtxfsiz[15];
} dwc_otg_core_global_regs_t;

/**
 * This union represents the bit fields of the Core OTG Control
 * and Status Register (GOTGCTL).  Set the bits using the bit
 * fields then write the <i>d32</i> value to the register.
 */
typedef union gotgctl_data {
	/** raw register data */
	uint32_t d32;
	/** register bits */
	struct {
		unsigned sesreqscs: 1;
		unsigned sesreq: 1;
		unsigned vbvalidoven: 1;
		unsigned vbvalidovval: 1;
		unsigned avalidoven: 1;
		unsigned avalidovval: 1;
		unsigned bvalidoven: 1;
		unsigned bvalidovval: 1;
		unsigned hstnegscs: 1;
		unsigned hnpreq: 1;
		unsigned hstsethnpen: 1;
		unsigned devhnpen: 1;
		unsigned reserved12_15: 4;
		unsigned conidsts: 1;
		unsigned dbnctime: 1;
		unsigned asesvld: 1;
		unsigned bsesvld: 1;
		unsigned otgver: 1;
		unsigned reserved1: 1;
		unsigned multvalidbc: 5;
		unsigned chirpen: 1;
		unsigned reserved28_31: 4;
	} b;
} gotgctl_data_t;

/**
 * This union represents the bit fields of the Core OTG Interrupt Register
 * (GOTGINT).  Set/clear the bits using the bit fields then write the <i>d32</i>
 * value to the register.
 */
typedef union gotgint_data {
	/** raw register data */
	uint32_t d32;
	/** register bits */
	struct {
		/** Current Mode */
		unsigned reserved0_1: 2;

		/** Session End Detected */
		unsigned sesenddet: 1;

		unsigned reserved3_7: 5;

