Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/source/ram/usb_otg/dwc_otg_regs.h
		/** Session Request Success Status Change */
		unsigned sesreqsucstschng: 1;
		/** Host Negotiation Success Status Change */
		unsigned hstnegsucstschng: 1;

		unsigned reserved10_16: 7;

		/** Host Negotiation Detected */
		unsigned hstnegdet: 1;
		/** A-Device Timeout Change */
		unsigned adevtoutchng: 1;
		/** Debounce Done */
		unsigned debdone: 1;
		/** Multi-Valued input changed */
		unsigned mvic: 1;

		unsigned reserved31_21: 11;

	} b;
} gotgint_data_t;

/**
 * This union represents the bit fields of the Core AHB Configuration
 * Register (GAHBCFG). Set/clear the bits using the bit fields then
 * write the <i>d32</i> value to the register.
 */
typedef union gahbcfg_data {
	/** raw register data */
	uint32_t d32;
	/** register bits */
	struct {
		unsigned glblintrmsk: 1;
#define DWC_GAHBCFG_GLBINT_ENABLE       1

		unsigned hburstlen: 4;
#define DWC_GAHBCFG_INT_DMA_BURST_SINGLE    0
#define DWC_GAHBCFG_INT_DMA_BURST_INCR      1
#define DWC_GAHBCFG_INT_DMA_BURST_INCR4     3
#define DWC_GAHBCFG_INT_DMA_BURST_INCR8     5
#define DWC_GAHBCFG_INT_DMA_BURST_INCR16    7

		unsigned dmaenable: 1;
#define DWC_GAHBCFG_DMAENABLE           1
		unsigned reserved: 1;
		unsigned nptxfemplvl_txfemplvl: 1;
		unsigned ptxfemplvl: 1;
#define DWC_GAHBCFG_TXFEMPTYLVL_EMPTY       1
#define DWC_GAHBCFG_TXFEMPTYLVL_HALFEMPTY   0
		unsigned reserved9_20: 12;
		unsigned remmemsupp: 1;
		unsigned notialldmawrit: 1;
		unsigned ahbsingle: 1;
		unsigned reserved24_31: 8;
	} b;
} gahbcfg_data_t;

/**
 * This union represents the bit fields of the Core USB Configuration
 * Register (GUSBCFG). Set the bits using the bit fields then write
 * the <i>d32</i> value to the register.
 */
typedef union gusbcfg_data {
	/** raw register data */
	uint32_t d32;
	/** register bits */
	struct {
		unsigned toutcal: 3;
		unsigned phyif: 1;
		unsigned ulpi_utmi_sel: 1;
		unsigned fsintf: 1;
		unsigned physel: 1;
		unsigned ddrsel: 1;
		unsigned srpcap: 1;
		unsigned hnpcap: 1;
		unsigned usbtrdtim: 4;
		unsigned reserved1: 1;
		unsigned phylpwrclksel: 1;
		unsigned otgutmifssel: 1;
		unsigned ulpi_fsls: 1;
		unsigned ulpi_auto_res: 1;
		unsigned ulpi_clk_sus_m: 1;
		unsigned ulpi_ext_vbus_drv: 1;
		unsigned ulpi_int_vbus_indicator: 1;
		unsigned term_sel_dl_pulse: 1;
		unsigned indicator_complement: 1;
		unsigned indicator_pass_through: 1;
		unsigned ulpi_int_prot_dis: 1;
		unsigned ic_usb_cap: 1;
		unsigned ic_traffic_pull_remove: 1;
		unsigned tx_end_delay: 1;
		unsigned force_host_mode: 1;
		unsigned force_dev_mode: 1;
		unsigned reserved31: 1;
	} b;
} gusbcfg_data_t;

/**
 * This union represents the bit fields of the Core Reset Register
 * (GRSTCTL).  Set/clear the bits using the bit fields then write the
 * <i>d32</i> value to the register.
 */
typedef union grstctl_data {
	/** raw register data */
	uint32_t d32;
	/** register bits */
	struct {
		/** Core Soft Reset (CSftRst) (Device and Host)
		 *
		 * The application can flush the control logic in the
		 * entire core using this bit. This bit resets the
		 * pipelines in the AHB Clock domain as well as the
		 * PHY Clock domain.
		 *
		 * The state machines are reset to an IDLE state, the
		 * control bits in the CSRs are cleared, all the
		 * transmit FIFOs and the receive FIFO are flushed.
		 *
		 * The status mask bits that control the generation of
		 * the interrupt, are cleared, to clear the
		 * interrupt. The interrupt status bits are not
		 * cleared, so the application can get the status of
		 * any events that occurred in the core after it has
		 * set this bit.
		 *
		 * Any transactions on the AHB are terminated as soon
		 * as possible following the protocol. Any
		 * transactions on the USB are terminated immediately.
		 *
		 * The configuration settings in the CSRs are
		 * unchanged, so the software doesn't have to
		 * reprogram these registers (Device
		 * Configuration/Host Configuration/Core System
		 * Configuration/Core PHY Configuration).
		 *
		 * The application can write to this bit, any time it
		 * wants to reset the core. This is a self clearing
		 * bit and the core clears this bit after all the
		 * necessary logic is reset in the core, which may
		 * take several clocks, depending on the current state
		 * of the core.
		 */
		unsigned csftrst: 1;
		/** Hclk Soft Reset
		 *
		 * The application uses this bit to reset the control logic in
		 * the AHB clock domain. Only AHB clock domain pipelines are
		 * reset.
		 */
		unsigned hsftrst: 1;
		/** Host Frame Counter Reset (Host Only)<br>
		 *
		 * The application can reset the (micro)frame number
		 * counter inside the core, using this bit. When the
		 * (micro)frame counter is reset, the subsequent SOF
		 * sent out by the core, will have a (micro)frame
		 * number of 0.
		 */
		unsigned hstfrm: 1;
		/** In Token Sequence Learning Queue Flush
		 * (INTknQFlsh) (Device Only)
		 */
		unsigned intknqflsh: 1;
		/** RxFIFO Flush (RxFFlsh) (Device and Host)
		 *
		 * The application can flush the entire Receive FIFO
		 * using this bit. The application must first
		 * ensure that the core is not in the middle of a
		 * transaction. The application should write into
		 * this bit, only after making sure that neither the
		 * DMA engine is reading from the RxFIFO nor the MAC
		 * is writing the data in to the FIFO. The
		 * application should wait until the bit is cleared
		 * before performing any other operations. This bit
		 * will takes 8 clocks (slowest of PHY or AHB clock)
		 * to clear.
		 */
		unsigned rxfflsh: 1;
		/** TxFIFO Flush (TxFFlsh) (Device and Host).
		 *
		 * This bit is used to selectively flush a single or
		 * all transmit FIFOs. The application must first
		 * ensure that the core is not in the middle of a
		 * transaction. The application should write into
		 * this bit, only after making sure that neither the
		 * DMA engine is writing into the TxFIFO nor the MAC
		 * is reading the data out of the FIFO. The
		 * application should wait until the core clears this
		 * bit, before performing any operations. This bit
		 * will takes 8 clocks (slowest of PHY or AHB clock)
		 * to clear.
		 */
		unsigned txfflsh: 1;

