Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/source/ram/usb_otg/dwc_otg_regs.h
		/** TxFIFO Number (TxFNum) (Device and Host).
		 *
		 * This is the FIFO number which needs to be flushed,
		 * using the TxFIFO Flush bit. This field should not
		 * be changed until the TxFIFO Flush bit is cleared by
		 * the core.
		 *   - 0x0 : Non Periodic TxFIFO Flush
		 *   - 0x1 : Periodic TxFIFO #1 Flush in device mode
		 *     or Periodic TxFIFO in host mode
		 *   - 0x2 : Periodic TxFIFO #2 Flush in device mode.
		 *   - ...
		 *   - 0xF : Periodic TxFIFO #15 Flush in device mode
		 *   - 0x10: Flush all the Transmit NonPeriodic and
		 *     Transmit Periodic FIFOs in the core
		 */
		unsigned txfnum: 5;
		/** Reserved */
		unsigned reserved11_29: 19;
		/** DMA Request Signal.  Indicated DMA request is in
		 * probress. Used for debug purpose. */
		unsigned dmareq: 1;
		/** AHB Master Idle.  Indicates the AHB Master State
		 * Machine is in IDLE condition. */
		unsigned ahbidle: 1;
	} b;
} grstctl_t;

/**
 * This union represents the bit fields of the Core Interrupt Mask
 * Register (GINTMSK). Set/clear the bits using the bit fields then
 * write the <i>d32</i> value to the register.
 */
typedef union gintmsk_data {
	/** raw register data */
	uint32_t d32;
	/** register bits */
	struct {
		unsigned reserved0: 1;
		unsigned modemismatch: 1;
		unsigned otgintr: 1;
		unsigned sofintr: 1;
		unsigned rxstsqlvl: 1;
		unsigned nptxfempty: 1;
		unsigned ginnakeff: 1;
		unsigned goutnakeff: 1;
		unsigned ulpickint: 1;
		unsigned i2cintr: 1;
		unsigned erlysuspend: 1;
		unsigned usbsuspend: 1;
		unsigned usbreset: 1;
		unsigned enumdone: 1;
		unsigned isooutdrop: 1;
		unsigned eopframe: 1;
		unsigned restoredone: 1;
		unsigned epmismatch: 1;
		unsigned inepintr: 1;
		unsigned outepintr: 1;
		unsigned incomplisoin: 1;
		unsigned incomplisoout: 1;
		unsigned fetsusp: 1;
		unsigned resetdet: 1;
		unsigned portintr: 1;
		unsigned hcintr: 1;
		unsigned ptxfempty: 1;
		unsigned lpmtranrcvd: 1;
		unsigned conidstschng: 1;
		unsigned disconnect: 1;
		unsigned sessreqintr: 1;
		unsigned wkupintr: 1;
	} b;
} gintmsk_data_t;
/**
 * This union represents the bit fields of the Core Interrupt Register
 * (GINTSTS).  Set/clear the bits using the bit fields then write the
 * <i>d32</i> value to the register.
 */
typedef union gintsts_data {
	/** raw register data */
	uint32_t d32;
#define DWC_SOF_INTR_MASK 0x0008
	/** register bits */
	struct {
#define DWC_HOST_MODE 1
		unsigned curmode: 1;
		unsigned modemismatch: 1;
		unsigned otgintr: 1;
		unsigned sofintr: 1;
		unsigned rxstsqlvl: 1;
		unsigned nptxfempty: 1;
		unsigned ginnakeff: 1;
		unsigned goutnakeff: 1;
		unsigned ulpickint: 1;
		unsigned i2cintr: 1;
		unsigned erlysuspend: 1;
		unsigned usbsuspend: 1;
		unsigned usbreset: 1;
		unsigned enumdone: 1;
		unsigned isooutdrop: 1;
		unsigned eopframe: 1;
		unsigned restoredone: 1;
		unsigned epmismatch: 1;
		unsigned inepint: 1;
		unsigned outepintr: 1;
		unsigned incomplisoin: 1;
		unsigned incomplisoout: 1;
		unsigned fetsusp: 1;
		unsigned resetdet: 1;
		unsigned portintr: 1;
		unsigned hcintr: 1;
		unsigned ptxfempty: 1;
		unsigned lpmtranrcvd: 1;
		unsigned conidstschng: 1;
		unsigned disconnect: 1;
		unsigned sessreqintr: 1;
		unsigned wkupintr: 1;
	} b;
} gintsts_data_t;

/**
 * This union represents the bit fields in the Device Receive Status Read and
 * Pop Registers (GRXSTSR, GRXSTSP) Read the register into the <i>d32</i>
 * element then read out the bits using the <i>b</i>it elements.
 */
typedef union device_grxsts_data {
	/** raw register data */
	uint32_t d32;
	/** register bits */
	struct {
		unsigned epnum: 4;
		unsigned bcnt: 11;
		unsigned dpid: 2;

#define DWC_STS_DATA_UPDT       0x2 // OUT Data Packet
#define DWC_STS_XFER_COMP       0x3 // OUT Data Transfer Complete

#define DWC_DSTS_GOUT_NAK       0x1 // Global OUT NAK
#define DWC_DSTS_SETUP_COMP     0x4 // Setup Phase Complete
#define DWC_DSTS_SETUP_UPDT 0x6 // SETUP Packet
		unsigned pktsts: 4;
		unsigned fn: 4;
		unsigned reserved25_31: 7;
	} b;
} device_grxsts_data_t;

/**
 * This union represents the bit fields in the Host Receive Status Read and
 * Pop Registers (GRXSTSR, GRXSTSP) Read the register into the <i>d32</i>
 * element then read out the bits using the <i>b</i>it elements.
 */
typedef union host_grxsts_data {
	/** raw register data */
	uint32_t d32;
	/** register bits */
	struct {
		unsigned chnum: 4;
		unsigned bcnt: 11;
		unsigned dpid: 2;

		unsigned pktsts: 4;
#define DWC_GRXSTS_PKTSTS_IN              0x2
#define DWC_GRXSTS_PKTSTS_IN_XFER_COMP    0x3
#define DWC_GRXSTS_PKTSTS_DATA_TOGGLE_ERR 0x5
#define DWC_GRXSTS_PKTSTS_CH_HALTED       0x7

		unsigned reserved21_31: 11;
	} b;
} host_grxsts_data_t;

/**
 * This union represents the bit fields in the FIFO Size Registers (HPTXFSIZ,
 * GNPTXFSIZ, DPTXFSIZn, DIEPTXFn). Read the register into the <i>d32</i> element
 * then read out the bits using the <i>b</i>it elements.
 */
typedef union fifosize_data {
	/** raw register data */
	uint32_t d32;
	/** register bits */
	struct {
		unsigned startaddr: 16;
		unsigned depth: 16;
	} b;
} fifosize_data_t;

/**
 * This union represents the bit fields in the Non-Periodic Transmit
 * FIFO/Queue Status Register (GNPTXSTS). Read the register into the
 * <i>d32</i> element then read out the bits using the <i>b</i>it
 * elements.
 */
typedef union gnptxsts_data {
	/** raw register data */
	uint32_t d32;
	/** register bits */
	struct {
		unsigned nptxfspcavail: 16;
		unsigned nptxqspcavail: 8;
		/** Top of the Non-Periodic Transmit Request Queue
		 *  - bit 24 - Terminate (Last entry for the selected
		 *    channel/EP)
		 *  - bits 26:25 - Token Type
		 *    - 2'b00 - IN/OUT
		 *    - 2'b01 - Zero Length OUT
		 *    - 2'b10 - PING/Complete Split
		 *    - 2'b11 - Channel Halt
		 *  - bits 30:27 - Channel/EP Number
		 */
		unsigned nptxqtop_terminate: 1;
		unsigned nptxqtop_token: 2;
		unsigned nptxqtop_chnep: 4;
		unsigned reserved: 1;
	} b;
} gnptxsts_data_t;

/**
 * This union represents the bit fields in the Transmit
 * FIFO Status Register (DTXFSTS). Read the register into the
 * <i>d32</i> element then read out the bits using the <i>b</i>it
 * elements.
 */
typedef union dtxfsts_data {
	/** raw register data */
	uint32_t d32;
	/** register bits */
	struct {
		unsigned txfspcavail: 16;
		unsigned reserved: 16;
	} b;
} dtxfsts_data_t;

/**
 * This union represents the bit fields in the I2C Control Register
 * (I2CCTL). Read the register into the <i>d32</i> element then read out the
 * bits using the <i>b</i>it elements.
 */
typedef union gi2cctl_data {
	/** raw register data */
	uint32_t d32;
	/** register bits */
	struct {
		unsigned rwdata: 8;
		unsigned regaddr: 8;
		unsigned addr: 7;
		unsigned i2cen: 1;
		unsigned ack: 1;
		unsigned i2csuspctl: 1;
		unsigned i2cdevaddr: 2;
		unsigned i2cdatse0: 1;
		unsigned reserved: 1;
		unsigned rw: 1;
		unsigned bsydne: 1;
	} b;
} gi2cctl_data_t;

/**
 * This union represents the bit fields in the PHY Vendor Control Register
 * (GPVNDCTL). Read the register into the <i>d32</i> element then read out the
 * bits using the <i>b</i>it elements.
 */
typedef union gpvndctl_data {
	/** raw register data */
	uint32_t d32;
	/** register bits */
	struct {
		unsigned regdata: 8;
		unsigned vctrl: 8;
		unsigned regaddr16_21: 6;
		unsigned regwr: 1;
		unsigned reserved23_24: 2;
		unsigned newregreq: 1;
		unsigned vstsbsy: 1;
		unsigned vstsdone: 1;
		unsigned reserved28_30: 3;
		unsigned disulpidrvr: 1;
	} b;
} gpvndctl_data_t;

/**
 * This union represents the bit fields in the General Purpose
 * Input/Output Register (GGPIO).
 * Read the register into the <i>d32</i> element then read out the
 * bits using the <i>b</i>it elements.
 */
typedef union ggpio_data {
	/** raw register data */
	uint32_t d32;
	/** register bits */
	struct {
		unsigned gpi: 16;
		unsigned gpo: 16;
	} b;
} ggpio_data_t;

/**
 * This union represents the bit fields in the User ID Register
 * (GUID). Read the register into the <i>d32</i> element then read out the
 * bits using the <i>b</i>it elements.
 */
typedef union guid_data {
	/** raw register data */
	uint32_t d32;
	/** register bits */
	struct {
		unsigned rwdata: 32;
	} b;
} guid_data_t;

/**
 * This union represents the bit fields in the Synopsys ID Register
 * (GSNPSID). Read the register into the <i>d32</i> element then read out the
 * bits using the <i>b</i>it elements.
 */
typedef union gsnpsid_data {
	/** raw register data */
	uint32_t d32;
	/** register bits */
	struct {
		unsigned rwdata: 32;
	} b;
} gsnpsid_data_t;

/**
 * This union represents the bit fields in the User HW Config1
 * Register.  Read the register into the <i>d32</i> element then read
 * out the bits using the <i>b</i>it elements.
 */
typedef union hwcfg1_data {
	/** raw register data */
	uint32_t d32;
	/** register bits */
	struct {
		unsigned ep_dir0: 2;
		unsigned ep_dir1: 2;
		unsigned ep_dir2: 2;
		unsigned ep_dir3: 2;
		unsigned ep_dir4: 2;
		unsigned ep_dir5: 2;
		unsigned ep_dir6: 2;
		unsigned ep_dir7: 2;
		unsigned ep_dir8: 2;
		unsigned ep_dir9: 2;
		unsigned ep_dir10: 2;
		unsigned ep_dir11: 2;
		unsigned ep_dir12: 2;
		unsigned ep_dir13: 2;
		unsigned ep_dir14: 2;
		unsigned ep_dir15: 2;
	} b;
} hwcfg1_data_t;

/**
 * This union represents the bit fields in the User HW Config2
 * Register.  Read the register into the <i>d32</i> element then read
 * out the bits using the <i>b</i>it elements.
 */
typedef union hwcfg2_data {
	/** raw register data */
	uint32_t d32;
	/** register bits */
	struct {
		/* GHWCFG2 */
		unsigned op_mode: 3;
#define DWC_HWCFG2_OP_MODE_HNP_SRP_CAPABLE_OTG 0
#define DWC_HWCFG2_OP_MODE_SRP_ONLY_CAPABLE_OTG 1
#define DWC_HWCFG2_OP_MODE_NO_HNP_SRP_CAPABLE_OTG 2
#define DWC_HWCFG2_OP_MODE_SRP_CAPABLE_DEVICE 3
#define DWC_HWCFG2_OP_MODE_NO_SRP_CAPABLE_DEVICE 4
#define DWC_HWCFG2_OP_MODE_SRP_CAPABLE_HOST 5
#define DWC_HWCFG2_OP_MODE_NO_SRP_CAPABLE_HOST 6

		unsigned architecture: 2;
		unsigned point2point: 1;
		unsigned hs_phy_type: 2;
#define DWC_HWCFG2_HS_PHY_TYPE_NOT_SUPPORTED 0
#define DWC_HWCFG2_HS_PHY_TYPE_UTMI 1
#define DWC_HWCFG2_HS_PHY_TYPE_ULPI 2
#define DWC_HWCFG2_HS_PHY_TYPE_UTMI_ULPI 3

