Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/source/ram/usb_otg/dwc_otg_regs.h
		/** BNA Interrupt mask */
		unsigned bna: 1;

		unsigned reserved10_12: 3;
		/** BNA Interrupt mask */
		unsigned nak: 1;

		unsigned reserved14_31: 18;
	} b;
} diepint_data_t;

/**
 * This union represents the bit fields in the Device IN EP
 * Common/Dedicated Interrupt Mask Register.
 */
typedef union diepint_data diepmsk_data_t;

/**
 * This union represents the bit fields in the Device OUT EP Interrupt
 * Registerand Device OUT EP Common Interrupt Mask Register.
 *
 * - Read the register into the <i>d32</i> member then set/clear the
 *   bits using the <i>b</i>it elements.
 */
typedef union doepint_data {
	/** raw register data */
	uint32_t d32;
	/** register bits */
	struct {
		/** Transfer complete */
		unsigned xfercompl: 1;
		/** Endpoint disable  */
		unsigned epdisabled: 1;
		/** AHB Error */
		unsigned ahberr: 1;
		/** Setup Phase Done (contorl EPs) */
		unsigned setup: 1;
		/** OUT Token Received when Endpoint Disabled */
		unsigned outtknepdis: 1;

		unsigned stsphsercvd: 1;
		/** Back-to-Back SETUP Packets Received */
		unsigned back2backsetup: 1;

		unsigned reserved7: 1;
		/** OUT packet Error */
		unsigned outpkterr: 1;
		/** BNA Interrupt */
		unsigned bna: 1;

		unsigned reserved10: 1;
		/** Packet Drop Status */
		unsigned pktdrpsts: 1;
		/** Babble Interrupt */
		unsigned babble: 1;
		/** NAK Interrupt */
		unsigned nak: 1;
		/** NYET Interrupt */
		unsigned nyet: 1;
		/** Bit indicating setup packet received */
		unsigned sr: 1;

		unsigned reserved16_31: 16;
	} b;
} doepint_data_t;

/**
 * This union represents the bit fields in the Device OUT EP
 * Common/Dedicated Interrupt Mask Register.
 */
typedef union doepint_data doepmsk_data_t;

/**
 * This union represents the bit fields in the Device All EP Interrupt
 * and Mask Registers.
 * - Read the register into the <i>d32</i> member then set/clear the
 *   bits using the <i>b</i>it elements.
 */
typedef union daint_data {
	/** raw register data */
	uint32_t d32;
	/** register bits */
	struct {
		/** IN Endpoint bits */
		unsigned in: 16;
		/** OUT Endpoint bits */
		unsigned out: 16;
	} ep;
	struct {
		/** IN Endpoint bits */
		unsigned inep0: 1;
		unsigned inep1: 1;
		unsigned inep2: 1;
		unsigned inep3: 1;
		unsigned inep4: 1;
		unsigned inep5: 1;
		unsigned inep6: 1;
		unsigned inep7: 1;
		unsigned inep8: 1;
		unsigned inep9: 1;
		unsigned inep10: 1;
		unsigned inep11: 1;
		unsigned inep12: 1;
		unsigned inep13: 1;
		unsigned inep14: 1;
		unsigned inep15: 1;
		/** OUT Endpoint bits */
		unsigned outep0: 1;
		unsigned outep1: 1;
		unsigned outep2: 1;
		unsigned outep3: 1;
		unsigned outep4: 1;
		unsigned outep5: 1;
		unsigned outep6: 1;
		unsigned outep7: 1;
		unsigned outep8: 1;
		unsigned outep9: 1;
		unsigned outep10: 1;
		unsigned outep11: 1;
		unsigned outep12: 1;
		unsigned outep13: 1;
		unsigned outep14: 1;
		unsigned outep15: 1;
	} b;
} daint_data_t;

/**
 * This union represents the bit fields in the Device IN Token Queue
 * Read Registers.
 * - Read the register into the <i>d32</i> member.
 * - READ-ONLY Register
 */
typedef union dtknq1_data {
	/** raw register data */
	uint32_t d32;
	/** register bits */
	struct {
		/** In Token Queue Write Pointer */
		unsigned intknwptr: 5;
		/** Reserved */
		unsigned reserved05_06: 2;
		/** write pointer has wrapped. */
		unsigned wrap_bit: 1;
		/** EP Numbers of IN Tokens 0 ... 4 */
		unsigned epnums0_5: 24;
	} b;
} dtknq1_data_t;

/**
 * This union represents Threshold control Register
 * - Read and write the register into the <i>d32</i> member.
 * - READ-WRITABLE Register
 */
typedef union dthrctl_data {
	/** raw register data */
	uint32_t d32;
	/** register bits */
	struct {
		/** non ISO Tx Thr. Enable */
		unsigned non_iso_thr_en: 1;
		/** ISO Tx Thr. Enable */
		unsigned iso_thr_en: 1;
		/** Tx Thr. Length */
		unsigned tx_thr_len: 9;
		/** AHB Threshold ratio */
		unsigned ahb_thr_ratio: 2;
		/** Reserved */
		unsigned reserved13_15: 3;
		/** Rx Thr. Enable */
		unsigned rx_thr_en: 1;
		/** Rx Thr. Length */
		unsigned rx_thr_len: 9;
		unsigned reserved26: 1;
		/** Arbiter Parking Enable*/
		unsigned arbprken: 1;
		/** Reserved */
		unsigned reserved28_31: 4;
	} b;
} dthrctl_data_t;

/**
 * Device Logical IN Endpoint-Specific Registers. <i>Offsets
 * 900h-AFCh</i>
 *
 * There will be one set of endpoint registers per logical endpoint
 * implemented.
 *
 * <i>These registers are visible only in Device mode and must not be
 * accessed in Host mode, as the results are unknown.</i>
 */
typedef struct dwc_otg_dev_in_ep_regs {
	/** Device IN Endpoint Control Register. <i>Offset:900h +
	 * (ep_num * 20h) + 00h</i> */
	volatile uint32_t diepctl;
	/** Reserved. <i>Offset:900h + (ep_num * 20h) + 04h</i> */
	uint32_t reserved04;
	/** Device IN Endpoint Interrupt Register. <i>Offset:900h +
	 * (ep_num * 20h) + 08h</i> */
	volatile uint32_t diepint;
	/** Reserved. <i>Offset:900h + (ep_num * 20h) + 0Ch</i> */
	uint32_t reserved0C;
	/** Device IN Endpoint Transfer Size
	 * Register. <i>Offset:900h + (ep_num * 20h) + 10h</i> */
	volatile uint32_t dieptsiz;
	/** Device IN Endpoint DMA Address Register. <i>Offset:900h +
	 * (ep_num * 20h) + 14h</i> */
	volatile uint32_t diepdma;
	/** Device IN Endpoint Transmit FIFO Status Register. <i>Offset:900h +
	 * (ep_num * 20h) + 18h</i> */
	volatile uint32_t dtxfsts;
	/** Device IN Endpoint DMA Buffer Register. <i>Offset:900h +
	 * (ep_num * 20h) + 1Ch</i> */
	volatile uint32_t diepdmab;
} dwc_otg_dev_in_ep_regs_t;

/**
 * Device Logical OUT Endpoint-Specific Registers. <i>Offsets:
 * B00h-CFCh</i>
 *
 * There will be one set of endpoint registers per logical endpoint
 * implemented.
 *
 * <i>These registers are visible only in Device mode and must not be
 * accessed in Host mode, as the results are unknown.</i>
 */
typedef struct dwc_otg_dev_out_ep_regs {
	/** Device OUT Endpoint Control Register. <i>Offset:B00h +
	 * (ep_num * 20h) + 00h</i> */
	volatile uint32_t doepctl;
	/** Reserved. <i>Offset:B00h + (ep_num * 20h) + 04h</i> */
	uint32_t reserved04;
	/** Device OUT Endpoint Interrupt Register. <i>Offset:B00h +
	 * (ep_num * 20h) + 08h</i> */
	volatile uint32_t doepint;
	/** Reserved. <i>Offset:B00h + (ep_num * 20h) + 0Ch</i> */
	uint32_t reserved0C;
	/** Device OUT Endpoint Transfer Size Register. <i>Offset:
	 * B00h + (ep_num * 20h) + 10h</i> */
	volatile uint32_t doeptsiz;
	/** Device OUT Endpoint DMA Address Register. <i>Offset:B00h
	 * + (ep_num * 20h) + 14h</i> */
	volatile uint32_t doepdma;
	/** Reserved. <i>Offset:B00h +   * (ep_num * 20h) + 18h</i> */
	uint32_t unused;
	/** Device OUT Endpoint DMA Buffer Register. <i>Offset:B00h
	 * + (ep_num * 20h) + 1Ch</i> */
	uint32_t doepdmab;
} dwc_otg_dev_out_ep_regs_t;

/**
 * This union represents the bit fields in the Device EP Control
 * Register.  Read the register into the <i>d32</i> member then
 * set/clear the bits using the <i>b</i>it elements.
 */
typedef union depctl_data {
	/** raw register data */
	uint32_t d32;
	/** register bits */
	struct {
		/** Maximum Packet Size
		 * IN/OUT EPn
		 * IN/OUT EP0 - 2 bits
		 *   2'b00: 64 Bytes
		 *   2'b01: 32
		 *   2'b10: 16
		 *   2'b11: 8 */
		unsigned mps: 11;
#define DWC_DEP0CTL_MPS_64   0
#define DWC_DEP0CTL_MPS_32   1
#define DWC_DEP0CTL_MPS_16   2
#define DWC_DEP0CTL_MPS_8    3

		/** Next Endpoint
		 * IN EPn/IN EP0
		 * OUT EPn/OUT EP0 - reserved */
		unsigned nextep: 4;

		/** USB Active Endpoint */
		unsigned usbactep: 1;

		/** Endpoint DPID (INTR/Bulk IN and OUT endpoints)
		 * This field contains the PID of the packet going to
		 * be received or transmitted on this endpoint. The
		 * application should program the PID of the first
		 * packet going to be received or transmitted on this
		 * endpoint , after the endpoint is
		 * activated. Application use the SetD1PID and
		 * SetD0PID fields of this register to program either
		 * D0 or D1 PID.
		 *
		 * The encoding for this field is
		 *   - 0: D0
		 *   - 1: D1
		 */
		unsigned dpid: 1;

		/** NAK Status */
		unsigned naksts: 1;

		/** Endpoint Type
		 *  2'b00: Control
		 *  2'b01: Isochronous
		 *  2'b10: Bulk
		 *  2'b11: Interrupt */
		unsigned eptype: 2;

		/** Snoop Mode
		 * OUT EPn/OUT EP0
		 * IN EPn/IN EP0 - reserved */
		unsigned snp: 1;

