Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/source/ram/usb_otg/dwc_otg_regs.h
		/** Stall Handshake */
		unsigned stall: 1;

		/** Tx Fifo Number
		 * IN EPn/IN EP0
		 * OUT EPn/OUT EP0 - reserved */
		unsigned txfnum: 4;

		/** Clear NAK */
		unsigned cnak: 1;
		/** Set NAK */
		unsigned snak: 1;
		/** Set DATA0 PID (INTR/Bulk IN and OUT endpoints)
		 * Writing to this field sets the Endpoint DPID (DPID)
		 * field in this register to DATA0. Set Even
		 * (micro)frame (SetEvenFr) (ISO IN and OUT Endpoints)
		 * Writing to this field sets the Even/Odd
		 * (micro)frame (EO_FrNum) field to even (micro)
		 * frame.
		 */
		unsigned setd0pid: 1;
		/** Set DATA1 PID (INTR/Bulk IN and OUT endpoints)
		 * Writing to this field sets the Endpoint DPID (DPID)
		 * field in this register to DATA1 Set Odd
		 * (micro)frame (SetOddFr) (ISO IN and OUT Endpoints)
		 * Writing to this field sets the Even/Odd
		 * (micro)frame (EO_FrNum) field to odd (micro) frame.
		 */
		unsigned setd1pid: 1;

		/** Endpoint Disable */
		unsigned epdis: 1;
		/** Endpoint Enable */
		unsigned epena: 1;
	} b;
} depctl_data_t;

/**
 * This union represents the bit fields in the Device EP Transfer
 * Size Register.  Read the register into the <i>d32</i> member then
 * set/clear the bits using the <i>b</i>it elements.
 */
typedef union deptsiz_data {
	/** raw register data */
	uint32_t d32;
	/** register bits */
	struct {
		/** Transfer size */
		unsigned xfersize: 19;
		/** Max packet count for EP (pow(2,10)-1) */
#define MAX_PKT_CNT 1023
		/** Packet Count */
		unsigned pktcnt: 10;
		/** Multi Count - Periodic IN endpoints */
		unsigned mc: 2;
		unsigned reserved: 1;
	} b;
} deptsiz_data_t;

/**
 * This union represents the bit fields in the Device EP 0 Transfer
 * Size Register.  Read the register into the <i>d32</i> member then
 * set/clear the bits using the <i>b</i>it elements.
 */
typedef union deptsiz0_data {
	/** raw register data */
	uint32_t d32;
	/** register bits */
	struct {
		/** Transfer size */
		unsigned xfersize: 7;
		/** Reserved */
		unsigned reserved7_18: 12;
		/** Packet Count */
		unsigned pktcnt: 2;
		/** Reserved */
		unsigned reserved21_28: 8;
		/**Setup Packet Count (DOEPTSIZ0 Only) */
		unsigned supcnt: 2;
		unsigned reserved31;
	} b;
} deptsiz0_data_t;

/////////////////////////////////////////////////
// DMA Descriptor Specific Structures
//

/** Buffer status definitions */

#define BS_HOST_READY   0x0
#define BS_DMA_BUSY     0x1
#define BS_DMA_DONE     0x2
#define BS_HOST_BUSY    0x3

/** Receive/Transmit status definitions */

#define RTS_SUCCESS     0x0
#define RTS_BUFFLUSH    0x1
#define RTS_RESERVED    0x2
#define RTS_BUFERR      0x3

/**
 * This union represents the bit fields in the DMA Descriptor
 * status quadlet. Read the quadlet into the <i>d32</i> member then
 * set/clear the bits using the <i>b</i>it, <i>b_iso_out</i> and
 * <i>b_iso_in</i> elements.
 */
typedef union dev_dma_desc_sts {
	/** raw register data */
	uint32_t d32;
	/** quadlet bits */
	struct {
		/** Received number of bytes */
		unsigned bytes: 16;
		/** NAK bit - only for OUT EPs */
		unsigned nak: 1;
		unsigned reserved17_22: 6;
		/** Multiple Transfer - only for OUT EPs */
		unsigned mtrf: 1;
		/** Setup Packet received - only for OUT EPs */
		unsigned sr: 1;
		/** Interrupt On Complete */
		unsigned ioc: 1;
		/** Short Packet */
		unsigned sp: 1;
		/** Last */
		unsigned l: 1;
		/** Receive Status */
		unsigned sts: 2;
		/** Buffer Status */
		unsigned bs: 2;
	} b;

//#ifdef DWC_EN_ISOC
	/** iso out quadlet bits */
	struct {
		/** Received number of bytes */
		unsigned rxbytes: 11;

		unsigned reserved11: 1;
		/** Frame Number */
		unsigned framenum: 11;
		/** Received ISO Data PID */
		unsigned pid: 2;
		/** Interrupt On Complete */
		unsigned ioc: 1;
		/** Short Packet */
		unsigned sp: 1;
		/** Last */
		unsigned l: 1;
		/** Receive Status */
		unsigned rxsts: 2;
		/** Buffer Status */
		unsigned bs: 2;
	} b_iso_out;

	/** iso in quadlet bits */
	struct {
		/** Transmited number of bytes */
		unsigned txbytes: 12;
		/** Frame Number */
		unsigned framenum: 11;
		/** Transmited ISO Data PID */
		unsigned pid: 2;
		/** Interrupt On Complete */
		unsigned ioc: 1;
		/** Short Packet */
		unsigned sp: 1;
		/** Last */
		unsigned l: 1;
		/** Transmit Status */
		unsigned txsts: 2;
		/** Buffer Status */
		unsigned bs: 2;
	} b_iso_in;
//#endif                                /* DWC_EN_ISOC */
} dev_dma_desc_sts_t;

/**
 * DMA Descriptor structure
 *
 * DMA Descriptor structure contains two quadlets:
 * Status quadlet and Data buffer pointer.
 */
typedef struct dwc_otg_dev_dma_desc {
	/** DMA Descriptor status quadlet */
	dev_dma_desc_sts_t status;
	/** DMA Descriptor data buffer pointer */
	uint32_t buf;
} dwc_otg_dev_dma_desc_t;

/**
 * The dwc_otg_dev_if structure contains information needed to manage
 * the DWC_otg controller acting in device mode. It represents the
 * programming view of the device-specific aspects of the controller.
 */
typedef struct dwc_otg_dev_if {
	/** Pointer to device Global registers.
	 * Device Global Registers starting at offset 800h
	 */
	dwc_otg_device_global_regs_t *dev_global_regs;
#define DWC_DEV_GLOBAL_REG_OFFSET 0x800

	/**
	 * Device Logical IN Endpoint-Specific Registers 900h-AFCh
	 */
	dwc_otg_dev_in_ep_regs_t *in_ep_regs[MAX_EPS_CHANNELS];
#define DWC_DEV_IN_EP_REG_OFFSET 0x900
#define DWC_EP_REG_OFFSET 0x20

	/** Device Logical OUT Endpoint-Specific Registers B00h-CFCh */
	dwc_otg_dev_out_ep_regs_t *out_ep_regs[MAX_EPS_CHANNELS];
#define DWC_DEV_OUT_EP_REG_OFFSET 0xB00

	/* Device configuration information */
	uint8_t speed;               /**< Device Speed  0: Unknown, 1: LS, 2:FS, 3: HS */
	uint8_t num_in_eps;      /**< Number # of Tx EP range: 0-15 exept ep0 */
	uint8_t num_out_eps;         /**< Number # of Rx EP range: 0-15 exept ep 0*/

	/** Size of periodic FIFOs (Bytes) */
	uint16_t perio_tx_fifo_size[MAX_PERIO_FIFOS];

	/** Size of Tx FIFOs (Bytes) */
	uint16_t tx_fifo_size[MAX_TX_FIFOS];

	/** Thresholding enable flags and length varaiables **/
	uint16_t rx_thr_en;
	uint16_t iso_tx_thr_en;
	uint16_t non_iso_tx_thr_en;

	uint16_t rx_thr_length;
	uint16_t tx_thr_length;

	/**
	 * Pointers to the DMA Descriptors for EP0 Control
	 * transfers (virtual and physical)
	 */

	/** 2 descriptors for SETUP packets */
	dwc_dma_t dma_setup_desc_addr[2];
	dwc_otg_dev_dma_desc_t *setup_desc_addr[2];

	/** Pointer to Descriptor with latest SETUP packet */
	dwc_otg_dev_dma_desc_t *psetup;

