Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/source/ram/usb_otg/dwc_otg_regs.h
/** OTG Host Interface Structure.
 *
 * The OTG Host Interface Structure structure contains information
 * needed to manage the DWC_otg controller acting in host mode. It
 * represents the programming view of the host-specific aspects of the
 * controller.
 */
typedef struct dwc_otg_host_if {
	/** Host Global Registers starting at offset 400h.*/
	dwc_otg_host_global_regs_t *host_global_regs;
#define DWC_OTG_HOST_GLOBAL_REG_OFFSET 0x400

	/** Host Port 0 Control and Status Register */
	volatile uint32_t *hprt0;
#define DWC_OTG_HOST_PORT_REGS_OFFSET 0x440

	/** Host Channel Specific Registers at offsets 500h-5FCh. */
	dwc_otg_hc_regs_t *hc_regs[MAX_EPS_CHANNELS];
#define DWC_OTG_HOST_CHAN_REGS_OFFSET 0x500
#define DWC_OTG_CHAN_REGS_OFFSET 0x20

	/* Host configuration information */
	/** Number of Host Channels (range: 1-16) */
	uint8_t num_host_channels;
	/** Periodic EPs supported (0: no, 1: yes) */
	uint8_t perio_eps_supported;
	/** Periodic Tx FIFO Size (Only 1 host periodic Tx FIFO) */
	uint16_t perio_tx_fifo_size;

} dwc_otg_host_if_t;

/**
 * This union represents the bit fields in the Power and Clock Gating Control
 * Register. Read the register into the <i>d32</i> member then set/clear the
 * bits using the <i>b</i>it elements.
 */
typedef union pcgcctl_data {
	/** raw register data */
	uint32_t d32;

	/** register bits */
	struct {
		/** Stop Pclk */
		unsigned stoppclk: 1;
		/** Gate Hclk */
		unsigned gatehclk: 1;
		/** Power Clamp */
		unsigned pwrclmp: 1;
		/** Reset Power Down Modules */
		unsigned rstpdwnmodule: 1;
		/** Reserved */
		unsigned reserved: 1;
		/** Enable Sleep Clock Gating (Enbl_L1Gating) */
		unsigned enbl_sleep_gating: 1;
		/** PHY In Sleep (PhySleep) */
		unsigned phy_in_sleep: 1;
		/** Deep Sleep*/
		unsigned deep_sleep: 1;
		unsigned resetaftsusp: 1;
		unsigned restoremode: 1;
		unsigned enbl_extnd_hiber: 1;
		unsigned extnd_hiber_pwrclmp: 1;
		unsigned extnd_hiber_switch: 1;
		unsigned ess_reg_restored: 1;
		unsigned prt_clk_sel: 2;
		unsigned port_power: 1;
		unsigned max_xcvrselect: 2;
		unsigned max_termsel: 1;
		unsigned mac_dev_addr: 7;
		unsigned p2hd_dev_enum_spd: 2;
		unsigned p2hd_prt_spd: 2;
		unsigned if_dev_mode: 1;
	} b;
} pcgcctl_data_t;

/**
 * This union represents the bit fields in the Global Data FIFO Software
 * Configuration Register. Read the register into the <i>d32</i> member then
 * set/clear the bits using the <i>b</i>it elements.
 */
typedef union gdfifocfg_data {
	/* raw register data */
	uint32_t d32;
	/** register bits */
	struct {
		/** OTG Data FIFO depth */
		unsigned gdfifocfg: 16;
		/** Start address of EP info controller */
		unsigned epinfobase: 16;
	} b;
} gdfifocfg_data_t;

/**
 * This union represents the bit fields in the Global Power Down Register
 * Register. Read the register into the <i>d32</i> member then set/clear the
 * bits using the <i>b</i>it elements.
 */
typedef union gpwrdn_data {
	/* raw register data */
	uint32_t d32;

	/** register bits */
	struct {
		/** PMU Interrupt Select */
		unsigned pmuintsel: 1;
		/** PMU Active */
		unsigned pmuactv: 1;
		/** Restore */
		unsigned restore: 1;
		/** Power Down Clamp */
		unsigned pwrdnclmp: 1;
		/** Power Down Reset */
		unsigned pwrdnrstn: 1;
		/** Power Down Switch */
		unsigned pwrdnswtch: 1;
		/** Disable VBUS */
		unsigned dis_vbus: 1;
		/** Line State Change */
		unsigned lnstschng: 1;
		/** Line state change mask */
		unsigned lnstchng_msk: 1;
		/** Reset Detected */
		unsigned rst_det: 1;
		/** Reset Detect mask */
		unsigned rst_det_msk: 1;
		/** Disconnect Detected */
		unsigned disconn_det: 1;
		/** Disconnect Detect mask */
		unsigned disconn_det_msk: 1;
		/** Connect Detected*/
		unsigned connect_det: 1;
		/** Connect Detected Mask*/
		unsigned connect_det_msk: 1;
		/** SRP Detected */
		unsigned srp_det: 1;
		/** SRP Detect mask */
		unsigned srp_det_msk: 1;
		/** Status Change Interrupt */
		unsigned sts_chngint: 1;
		/** Status Change Interrupt Mask */
		unsigned sts_chngint_msk: 1;
		/** Line State */
		unsigned linestate: 2;
		/** Indicates current mode(status of IDDIG signal) */
		unsigned idsts: 1;
		/** B Session Valid signal status*/
		unsigned bsessvld: 1;
		/** ADP Event Detected */
		unsigned adp_int: 1;
		/** Multi Valued ID pin */
		unsigned mult_val_id_bc: 5;
		/** Reserved 24_31 */
		unsigned reserved29_31: 3;
	} b;
} gpwrdn_data_t;

#endif
